import copy

# copy.deepcopy() - Делает полную копию списка

x = [1, [2, 3, 4, 5]]
y = copy.deepcopy(x)
print(x is y, y) # Но остаются разными обектами

arr = [1, 2, 3, 4, 5]
print(arr[::-1]) # Выводим список в обратном порядке

print(arr[:-2]) # Вывидом список без двух последних элементов

print(arr[-3:]) # Вывидом список трех последних элементов

arr[-1:] = [] # Удаляем последний элемент
print(arr)

arr1 = [6, 7, 8, 9, 10, 'V', 'D', 'K', 'T']
arr2 = ['_b', '_d', '_l', '_s']
arr4 = []

"""
i = 0
j = 0
arr4 = []
while i < len(arr1):
    while j < len(arr2):
        arr3 = ['%s' % arr1[i] + '%s' % arr2[j]]
        arr4 += arr3
        j += 1
    i += 1 

print(arr4) # ['dd1', 'dd2', 'dd3']
"""

for i in range(len(arr1)):
    for j in range(len(arr2)):
        arr3 = ['%s' % arr1[i] + '%s' % arr2[j]]
        arr4 += arr3
print(arr4) # 36 ['6_b', '6_d', '6_l',... 'K_s', 'T_b', 'T_d', 'T_l', 'T_s']


arr5 = [1, 2, 3, 4, 5]
arr5 = [i * 10 for i in arr5 if not i % 2 == 0]
print(arr5) # Выводит нечетные числа: [10, 30, 50]

arr6 = [[1, 2], [3, 4], [5, 6]]
arr6 = [j * 10 for i in arr6 for j in i if j % 2 == 0]
print(arr6) # Выводит четные числа: [20, 40, 60]

# Функция map() возвращает объект, который следует передать в функцию list().

def func(e1, е2, еЗ) :
    """ Суммирование элементов трех разных списков"""
    return e1 + е2 + еЗ # Возвращаем новое значение
ar_1 = [1, 2, 3, 4, 5]
ar_2 = [10, 20, 30, 40, 50]
аг_З = [100, 200, 300, 400, 500]
print(list(map(func, ar_1, ar_2, аг_З))) # Результат выполнения: [111, 222, 333, 444, 555]

# zip() возвращает содержащий кортеж элементы, которые расположены на одинаковом смещении.

k_1 = list(zip([1, 2, 3], [4, 5, 6], [7, 8, 9]))
print(k_1) # [(1, 4, 7), (2, 5, 8), (3, 6, 9)]




