# Словари — это наборы объектов, доступ к которым осуществляется не по индексу, а по ключу

# ♦ dict() - создает словарь

d_1 = dict({"a": 1, "b": 2, "c": 3}) # Словарь
print("d_1: ", d_1)

d_2 = dict([["v", 4], ["s", 2]]) # Список списков
print("d_2: ", d_2)

d_3 = dict([("c", 2), ("v", 6), ("d", 7)]) # Список кортежей
print("d_3: ", d_3)

# zip () - Позволяет объединить два списка в список кортежей 

l_1 = ["a", "b"]
l_2 = [10, 3]
d_4 = dict(zip(l_1, l_2))
print("d_4: ", d_4)

d_5 = dict.fromkeys(["a", "b", "c"], 12)
print("d_5: ", d_5)

del d_5["c"]
print("d_5: ", d_5)

for key in d_3.keys():
    print("({0}: {1})".format("d_3: " + key, d_3[key]), end=" ")
print()

# d1.keys() | d2.keys() - Обьединение словарей
# d1.keys() - d2.keys() # Разница
# d1.keys() & d2.keys() # Одинаковые ключи
# d1.keys() ^ d2.keys() # Уникальные ключи


print("d_4: ", d_4.get("a"), d_4.get("c"), d_4.get("c", 800))